 { 
  "chapters": [
    {
      "id": "Chapter 01",
      "name": "Introduction to the course",
      "description": "What is my goal? At the end of the year I want you to be more creative, organised and optimistic. Your fresh new marketing skills will give you a new point of view about the digital world. How to achieve that? For that purpose I've built an atypical course to help you discover and practice digital marketing skills. In my opinion there is no such way to learn than by playing. That's why the course is focused around a personal and transversal project. Your Project. The first module is dedicated to finding and defining your Project idea. You will learn how to setup the basics knowledge and information you must have on a project in order to promote it online the right way. In the second and third modules we'll learn how to spread the word effectively on search engines and social media. What am I expecting from you? I want you to take very seriously the first module as it will significantly drive the success of the course. I give you the opportunity to work on a Project that matters to you. Your Project will be your souce of inspiration and motivation throughout this course. At the end of this course you'll know exactly how to imagine, design and deploy a project idea on the web.",
      "objectives": [
        {
          "id": "Objective 1",
          "description": "Being comfortable discovering and understanding client's needs and expectations."
        },
        {
          "id": "Objective 2",
          "description": "Being comfortable using digital marketing tools."
        },
        {
          "id": "Objective 3",
          "description": "Have a clear vision on how to develop a digital presence for a company, a brand or a product."
        }
      ],
      "metas": [
        {
          "name": "Progress",
          "description": "1/8"
        },
        {
          "name": "Duration",
          "description": "0 hour"
        },
        {
          "name": "Resources",
          "description": "No resources"
        }
      ],
      "url": "chapters/chapter-01.html",
      "moduleRef": "Module 01",
      "bgColor": "red",
      "status": "enabled"
    },
    {
      "id": "Chapter 02",
      "name": "What are you willing to work on?",
      "description": "Have you ever heard about the Business Model Canvas? A Business Model Canvas forms the basements of every entrepreneurial projects. Whatever you want to build working with this concept will help you identify all the aspects that are essentials to the success of your project. During this course, we'll keep out the profitability aspect of the project so we can focus on what will make your project stands out with your audience. Finding who are the users of your Target Audience as well as what is the best Value Proposition will be the main missions of this chapter. By starting this course with the Business Model Canvas you're going to tackle a lot of marketing concepts that will help you determine how to promote efficiently your project on Search Engines and Social Networks whether you want to convince your Target Audience to buy, use or share your product/service/content. If you work for a client you'll need to have the same level of understanding of his project in order to make things right. In this situation, the Business Model Canvas and the Value Proposition Canvas will help you identify the key information you need to know or define before even working on any marketing medium.",
      "url": "chapters/chapter-02.html",
      "objectives": [
        {
          "id": "Objective 1",
          "description": "Learn how to ideate and find your transversal project idea."
        },
        {
          "id": "Objective 2",
          "description": "Understand the marketing stakes of a project."
        },
        {
          "id": "Objective 3",
          "description": "Clearly define what your Product/Service is and who you do that for."
        }
      ],
      "metas": [
        {
          "name": "Progress",
          "description": "2/8"
        },
        {
          "name": "Duration",
          "description": "12 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/18tsm_sUHLGcYyY5ED_PbUK9CvghDmpIn\"> Google Drive folder</a>"
        }
      ],
      "moduleRef": "Module 01",
      "bgColor": "red",
      "status": "enabled"
    },
    {
      "id": "Chapter 03",
      "name": "Write & Structure your website",
      "description": "During this course you will learn how to structure your home page in order to capture the visitor’s interest. You will use the research that you’ve conducted through the Value Proposition Canvas to write the content as shown in the home page template. Your page’s job is to encourage visitors to read and scroll through the content and convince them to complete your ultimate conversion action (subscribe, buy, order, sign-up, ...). Very specific sections and copywriting elements will help you to reach this goal efficiently. The page template I give you is built to get the most conversions out of the total traffic you can generate on your page. However, most of the job consists in writing a content that resonates in the mind of your audience. Your preliminary research will help you choose the right words, the right statements and the right ton to express your business value.",
      "url": "chapters/chapter-03.html",
      "objectives": [
        {
          "id": "Objective 1",
          "description": "Learn what are the components of conversion-centric web page."
        },
        {
          "id": "Objective 2",
          "description": "Define and implement your copywriting plan."
        },
        {
          "id": "Objective 3",
          "description": "Summarize your research findings into intelligible and meaningful copywriting."
        }
      ],
      "metas": [
        {
          "name": "Progress",
          "description": "3/8"
        },
        {
          "name": "Duration",
          "description": "12 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/18tsm_sUHLGcYyY5ED_PbUK9CvghDmpIn\"> Google Drive folder</a>"
        }
      ],
      "moduleRef": "Module 01",
      "bgColor": "red",
      "status": "enabled"
    },
    {
      "id": "Chapter 04",
      "name": "What is Content Marketing?",
      "description": "Having the content to describe your service / product / offer is good but it’s not enough for you to thrive. Developing a content strategy is essential. Content marketing is a very recent practice on the web. Since a few years we can see more and more content created on the web and some of them are used to drive awareness, interest and value for many businesses. The process of developing a content strategy will help you design a content environment around your product or service to acquire and activate people to complete specific conversion actions. Your content must address the audience’s needs at different levels of awareness to capture as much opportunities as you can. In this course will see what is the logic behind a content strategy and how to apply it concretely in order to build an efficient content environment. Your mission will be to define the topics of interest related to the various levels of awareness of your audience, write the different pieces of content and then connect them together.",
      "url": "chapters/chapter-04.html",
      "objectives": [
        {
          "id": "Objective 1",
          "description": "Understand what are the benefits of Content Marketing."
        },
        {
          "id": "Objective 2",
          "description": "Be able to represent and build a content environment."
        },
        {
          "id": "Objective 3",
          "description": "Practice quality writing and learn how to build a content network that generates conversions."
        }
      ],
      "metas": [
        {
          "name": "Progress",
          "description": "4/8"
        },
        {
          "name": "Duration",
          "description": "6 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/18tsm_sUHLGcYyY5ED_PbUK9CvghDmpIn\"> Google Drive folder</a>"
        }
      ],
      "moduleRef": "Module 01",
      "bgColor": "red",
      "status": "enabled"
    },
    {
      "id": "Chapter 05",
      "name": "Search Engine Optimisation",
      "description": "I'm chapter 4 description",
      "metas": [
        {
          "name": "Progress",
          "description": "5/8"
        },
        {
          "name": "Duration",
          "description": "8 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/1em-hiWCYWjhmYLfAFzivnlg9Y3zq8IKn\"> Google Drive folder</a>"
        }
      ],
      "url": "",
      "moduleRef": "Module 02",
      "bgColor": "purple",
      "status": "disabled"
    },
    {
      "id": "Chapter 06",
      "name": "Search Engine Advertising",
      "description": "I'm chapter 5 description",
      "metas": [
        {
          "name": "Progress",
          "description": "6/8"
        },
        {
          "name": "Duration",
          "description": "13 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/1em-hiWCYWjhmYLfAFzivnlg9Y3zq8IKn\"> Google Drive folder</a>"
        }
      ],
      "url": "",
      "moduleRef": "Module 02",
      "bgColor": "purple",
      "status": "disabled"
    },
    {
      "id": "Chapter 07",
      "name": "Social Medial Advertising",
      "description": "I'm chapter 6 description",
      "metas": [
        {
          "name": "Progress",
          "description": "7/8"
        },
        {
          "name": "Duration",
          "description": "19 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/1ZiMxY8_42kQYAi-MdbqKt-TscvMUhtPC\"> Google Drive folder</a>"
        }
      ],
      "url": "",
      "moduleRef": "Module 03",
      "bgColor": "green",
      "status": "disabled"
    },
    {
      "id": "Chapter 08",
      "name": "Social Medial Optimisation",
      "description": "I'm chapter 7 description",
      "metas": [
        {
          "name": "Progress",
          "description": "8/8"
        },
        {
          "name": "Duration",
          "description": "2 hours"
        },
        {
          "name": "Resources",
          "description": "<a target=\"_blank\" href=\"https://drive.google.com/drive/u/0/folders/1ZiMxY8_42kQYAi-MdbqKt-TscvMUhtPC\"> Google Drive folder</a>"
        }
      ],
      "url": "",
      "moduleRef": "Module 03",
      "bgColor": "green",
      "status": "disabled"
    }
  ],

  "modules": [
    {
      "id": "Module 01",
      "name": "Your project",
      "description": "The objective of module 01 is to choose and develop a transversal project. A project on which you’re going to experiment the stuff you’ll learn throughout this course. From Business Canvas Research to Website Copywriting you'll learn how to introduce your project in order to make it attractive to your specific audience.",
      "url": "",
      "bgColor": "red"
    },
    {
      "id": "Module 02",
      "name": "Your project on Search Engines",
      "description": "The objective of module 02 is to learn how to be organically visible on search engines but also learn how to promote your product or service with paid ads. From Keywords Research to Ad Copywriting you'll learn how to make your project stand out on the web.",
      "url": "",
      "bgColor": "purple"
    },
    {
      "id": "Module 03",
      "name": "Your project on Social Networks",
      "description": "The objective of module 03 is to learn how to animate your product or service on social networks. Being present on social networks is now essential for companies if they want to create connections online. From Content Marketing Strategies to Ad Copywriting you'll learn how to make your project shine on social networks.",
      "url": "",
      "bgColor": "green"
    }
  ],

  "socials": [
    {
      "logo": "media/logos/social/github-logo.svg",
      "imgAlt": "Github brand logo",
      "description": "I publish my digital experiments on Github.",
      "url": "https://github.com/elechaudel/"
    },
    {
      "logo": "media/logos/social/twitter-logo.svg",
      "imgAlt": "Twitter brand logo",
      "description": "I retweet nice articles and inspiring quotes on Twitter.",
      "url": "https://twitter.com/elechaudel"
    },
    {
      "logo": "media/logos/social/linkedin-logo.svg",
      "imgAlt": "Linkedin brand logo",
      "description": "I’m happy to connect with you on Linkedin for any requests.",
      "url": "https://lu.linkedin.com/in/edgarlechaudel"
    }
  ],

  "configs": [
    {
      "root": "https://elechaudel.github.io/learn/app/dist/"
    }
  ]
 } 